#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖`Success! The configuration is valid.

`
#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```

terraform
Running plan in the remote backend. Output will stream here. Pressing Ctrl-C
will stop streaming the logs, but will not stop the plan running remotely.

Preparing the remote plan...

To view this run in a browser, visit:
https://app.terraform.io/app/terraform-personal-study/demo-github-actions/runs/run-ekT69pCeqULYsm8F

Waiting for the plan to start...

Terraform v1.2.1
on linux_amd64
Initializing plugins and modules...

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # google_storage_bucket.GCS1 will be created
  + resource "google_storage_bucket" "GCS1" {
      + force_destroy               = false
      + id                          = (known after apply)
      + labels                      = {
          + "dep" = "compliance"
          + "env" = "tf_env"
        }
      + location                    = "EU"
      + name                        = "tf-course-from-terraform-cloud"
      + project                     = (known after apply)
      + self_link                   = (known after apply)
      + storage_class               = "NEARLINE"
      + uniform_bucket_level_access = true
      + url                         = (known after apply)

      + lifecycle_rule {
          + action {
              + storage_class = "COLDLINE"
              + type          = "SetStorageClass"
            }

          + condition {
              + age                   = 5
              + matches_storage_class = []
              + with_state            = (known after apply)
            }
        }

      + retention_policy {
          + is_locked        = false
          + retention_period = 864000
        }
    }

  # google_storage_bucket_object.picture will be created
  + resource "google_storage_bucket_object" "picture" {
      + bucket         = "tf-course-from-terraform-cloud"
      + content_type   = (known after apply)
      + crc32c         = (known after apply)
      + detect_md5hash = "different hash"
      + id             = (known after apply)
      + kms_key_name   = (known after apply)
      + md5hash        = (known after apply)
      + media_link     = (known after apply)
      + name           = "terraform_workflow"
      + output_name    = (known after apply)
      + self_link      = (known after apply)
      + source         = "Terraform-3000x1500.png"
      + storage_class  = (known after apply)
    }

Plan: 2 to add, 0 to change, 0 to destroy.


```

</details>

*Pusher: @AlexisSalazar, Action: `pull_request`*